#############################################
#   Тут находятся основные настройки бота   #
#############################################

IdAdmin = 728062416     # ID Админа, его можно запустив бота и прописав ID
BotToken = '827029260:AAFXXhHCTXdjzKLamu_TxbiB8io1DeY_0TQ'      # TOKEN бота

QIWI_TOKEN = 'token'     # Токен киви https://qiwi.com/api
QIWI_ACCOUNT = '+77777777777'   # Номер аккаунта или ник

percent_referral_system = 10    # По стандарку 10, если вы изменяете, то не забудьте изменить и текст реферальной системы

login_bot = 'bigsnus_bot'    # Логин вашего бот, например shop123_bot

# Сообщение оплаты
cb = '''
❗️️ Вы выбрали {}

🥝 Оплата по средствам QIWI:
 Номер: +99999999999
 Комментарий к платежу: {}
 Сумма: {} ₽

❗️ После оплаты напишите @login или +99999999999 и сообщите комментарий к оплате, и адрес доставки.

❗️ Если бот не видит вашего перерода, а вы действительно произвели оплату, напишите нам в поддержку и ваш заказ будет обработан нашим оператором!
'''

referral_system = '''
💵 Реферальная система 🤝

Приглашайте новых пользователей и получайте пассивный доход, а именно 10% от продаж! 💵

Например вы приводите человека и он покупает на 1000 руб вы получите 100 руб!!!

Ваша реф. сыллка:
https://tele.gg/{login}?start={referral_code}

📊Статистика:
Приведенных пользователей: {}
Количество покупок: {}
Сумма ваших доходов: {} руб
'''


